benchmarks/sglang/runpod_h100sxm/Llama3.1-70B/tp4_dp2_Llama3.1-70B_in4096_out128_p100_c100_3168fa.txt
BENCHMARK: tp4_dp2_Llama3.1-70B_in4096_out128_p100_c100_3168fa
================================================================
Command: python -m sglang.bench_serving --port 30000 --model /workspace/llama-3.1-70b --host 127.0.0.1 --backend sglang --dataset-name random --random-input-len 4096 --random-output-len 128 --num-prompts 100 --max-concurrency 100 --request-rate inf --output-file ./benchmark_results_Llama3.1-70B_tp4_dp2_H100/tp4_dp2_Llama3.1-70B_in4096_out128_p100_c100_3168fa.jsonl --output-details
================================================================

benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='/workspace/llama-3.1-70b', served_model_name=None, tokenizer=None, num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=100, output_file='./benchmark_results_Llama3.1-70B_tp4_dp2_H100/tp4_dp2_Llama3.1-70B_in4096_out128_p100_c100_3168fa.jsonl', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

WARNING It is recommended to use the `Chat` or `Instruct` model for benchmarking.
Because when the tokenizer counts the output tokens, if there is gibberish, it might count incorrectly.

Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='/workspace/llama-3.1-70b', served_model_name=None, tokenizer=None, num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=4096, random_output_len=128, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=100, output_file='./benchmark_results_Llama3.1-70B_tp4_dp2_H100/tp4_dp2_Llama3.1-70B_in4096_out128_p100_c100_3168fa.jsonl', output_details=True, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 209181
#Output tokens: 6108
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:01<02:52,  1.74s/it]
  2%|▏         | 2/100 [00:05<04:47,  2.94s/it]
  6%|▌         | 6/100 [00:05<01:05,  1.44it/s]
 10%|█         | 10/100 [00:05<00:31,  2.86it/s]
 15%|█▌        | 15/100 [00:05<00:16,  5.24it/s]
 19%|█▉        | 19/100 [00:05<00:10,  7.55it/s]
 25%|██▌       | 25/100 [00:06<00:06, 11.93it/s]
 32%|███▏      | 32/100 [00:06<00:03, 17.28it/s]
 37%|███▋      | 37/100 [00:06<00:03, 20.80it/s]
 42%|████▏     | 42/100 [00:06<00:02, 21.40it/s]
 47%|████▋     | 47/100 [00:06<00:02, 24.88it/s]
 52%|█████▏    | 52/100 [00:06<00:01, 26.17it/s]
 56%|█████▌    | 56/100 [00:06<00:01, 28.44it/s]
 62%|██████▏   | 62/100 [00:07<00:01, 34.57it/s]
 70%|███████   | 70/100 [00:07<00:00, 42.65it/s]
 80%|████████  | 80/100 [00:07<00:00, 53.47it/s]
 86%|████████▌ | 86/100 [00:07<00:00, 50.55it/s]
 92%|█████████▏| 92/100 [00:07<00:00, 38.74it/s]
 99%|█████████▉| 99/100 [00:07<00:00, 41.35it/s]
100%|██████████| 100/100 [00:07<00:00, 12.67it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 100       
Successful requests:                     100       
Benchmark duration (s):                  7.92      
Total input tokens:                      209181    
Total input text tokens:                 209181    
Total generated tokens:                  6108      
Total generated tokens (retokenized):    6095      
Request throughput (req/s):              12.62     
Input token throughput (tok/s):          26406.85  
Output token throughput (tok/s):         771.07    
Peak output token throughput (tok/s):    3124.00   
Peak concurrent requests:                100       
Total token throughput (tok/s):          27177.92  
Concurrency:                             83.88     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   6644.26   
Median E2E Latency (ms):                 6738.36   
P90 E2E Latency (ms):                    7573.41   
P99 E2E Latency (ms):                    7832.62   
---------------Time to First Token----------------
Mean TTFT (ms):                          3258.89   
Median TTFT (ms):                        3372.95   
P99 TTFT (ms):                           5532.04   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          119.89    
Median TPOT (ms):                        59.09     
P99 TPOT (ms):                           1039.48   
---------------Inter-Token Latency----------------
Mean ITL (ms):                           56.35     
Median ITL (ms):                         19.77     
P95 ITL (ms):                            22.90     
P99 ITL (ms):                            1511.94   
Max ITL (ms):                            5142.80   
==================================================